[
  {
    "id": "azorians-bounty",
    "name": "Azorian's Bounty",
    "pronunciation": "ah-ZOR-ee-an's BOWN-tee",
    "teaser": "A vast and mysterious archipelago filled with ancient secrets, bustling cities, and untold adventures waiting to be discovered.",
    "detail": "**Azorian's Bounty** is a sprawling archipelago of islands, each with its own unique character, history, and mysteries. From the desert oasis city of Sandhaven to the massive port city of Stormharbor, this realm offers countless opportunities for adventure, trade, and discovery.\n\n### Overview\nThe archipelago consists of numerous islands, each with distinct cultures, climates, and political structures. Trade routes connect the various settlements, creating a complex web of relationships, alliances, and conflicts.\n\n### Major Locations\nThe Bounty is home to several major settlements, each serving as a hub for different types of activity - from trade and scholarship to adventure and intrigue.",
    "mapImg": "/images/maps/azorians_bounty.jpg",
    "locations": [
      {
        "id": "area-1753030930140",
        "name": "Sandhaven",
        "pronunciation": "SAND-hay-ven",
        "x": 30.372293030643476,
        "y": 87.44027480048555,
        "width": 7.314144035950875,
        "height": 4.132338128567369,
        "teaser": "**Sandhaven** thrives as a vital *oasis city* ruled by a Caliphate. It's known for its exotic goods, bustling markets, and the golden shimmer of the surrounding dunes.",
        "detail": "A large desert settlement with a distinct Middle Eastern vibe, Sandhaven thrives as a vital oasis city ruled by a Caliphate. It's known for its exotic goods, bustling markets, and the golden shimmer of the surrounding dunes.\n\n### Population\nApproximately 4,000 residents\n\n\tHumans: 40%\n\tDwarves: 25%\n\tHalf-Orcs: 20%\n\tTieflings: 10%\n\tOther (including Dragonborn and Gnomes): 5%\n\n### City Guard\n**Dira' al-Waha (DEE-ra al-WAH-ha) Shield of the Oasis:** A dedicated guard force loyal to the citizens of Sandhaven, heavily tattooed with colorful, swirling symbols. Their primary duty is to ensure the safety and well-being of the city's inhabitants.\n\n### Districts\n- **The Oasis Bazaar (Souk Quarter):** The bustling heart of Sandhaven, where trade routes converge. This vibrant district is filled with stalls, shops, and temporary merchant tents offering everything from exotic spices and fine silks to desert-forged tools and rare trinkets. It's the primary point of contact for visitors and the economic engine of the city.\n\n- **The Palm Grove Ward (Hayy al-Nakheel):** The oldest residential area, characterized by its dense palm groves and close proximity to Sandhaven's vital water sources. Homes here are typically built from adobe or stone, offering cool refuge from the desert heat. It's primarily inhabited by long-term residents.\n\n- **The Watcher's Rise (Talat al-Ra'i):** Perched on the highest point, this district centers around Bayt al-Nujum. It primarily houses scholars, mystics, and those associated with the observatory, as well as the more established and secluded residences. The architecture here is often more ornate and reflects a focus on knowledge and contemplation.\n\n- **The Caravanserai Grounds (Ardh al-Qafila):** Located near the city gates, this area is dedicated to accommodating the constant flow of travelers, traders, and their beasts of burden. It features large courtyards, stables, basic inns, and workshops catering to transient needs. It's a rougher, more transient part of the city, bustling with diverse faces.\n\n- **The Crafters' Lane (Darb al-Sanaa):** A less prominent but vital district where local artisans, blacksmiths, potters, and weavers ply their trades. The air often carries the scent of hammered metal, clay, or dyed fabrics. This area serves the daily needs of the city's\n\n### Notable Shops / Taverns / Inns\n\n- **The Oasis Bazaar:** A bustling marketplace offering exotic goods from the desert, including spices, carpets, and magical trinkets. It's especially vibrant during the Oasis Festival.\n\n- **The Golden Scimitar (Tavern & Inn - For Royalty/Dignitaries):** Nestled discreetly in the Watcher's Rise, this opulent establishment caters to visiting dignitaries and those of noble birth. Its private chambers offer unparalleled luxury, and its culinary delights are legendary. Security is paramount, often provided by the Caliphate's own guards, ensuring discretion and safety.\n\n- **The Spice Trader's Respite (Tavern & Inn - For Merchants):** Located within the lively Oasis Bazaar, this sprawling inn is a hub for merchants. It offers comfortable, no-nonsense rooms, ample secure storage for goods, and a large common room where deals are struck over strong tea and hearty stew. The clientele are a mix of seasoned traders and ambitious newcomers.\n\n- **The Shifting Sands Inn (Tavern & Inn - For Sellswords/Mercenaries/Crews):** A raucous, no-frills establishment found in the Caravanserai Grounds, close to the city gates. It caters to the rougher element: sellswords, desert guides, caravanners, and ship's crews seeking coin or passage. The air is thick with boasts, grudges, and whispered rumors of dangerous ventures. Basic beds are offered, and the ale flows freely.\n\n- **Al-Gharib's Curios (Shop - Unusual Items):** Tucked away in a quiet corner of the Oasis Bazaar, this dimly lit shop is run by the enigmatic Al-Gharib, a cloaked figure rarely seen without a rare artifact in hand. It specializes in oddities, forgotten relics, peculiar magical components, and items with mysterious origins from across the desert and beyond. Patrons never quite know what they'll find, from cursed jewelry to potent but unstable powders.\n\n### Points of Interest\n\n- **Bayt al-Nujum (House of Stars):** Perched atop Sandhaven's highest point, Bayt al-Nujum is a grand domed observatory adorned with intricate brass filigree and sapphire inlays. Its scholars, known as the [[Ruqqab al-Lānihāyah]], once welcomed seekers of celestial wisdom. Recently, the observatory has been mysteriously sealed, its great doors locked with powerful wards. The scholars' final message to the people of Sandhaven was chilling: \"**The sky has broken.**\"\n\n- **Sunblade Dunes:** A vast desert expanse with sand dunes that seem to shimmer like gold in the sun, surrounding the city.\n\n### Notable NPCs\n\n- **Sarif al-Sahar:** The charismatic Caliph and leader of Sandhaven, known for his diplomacy and shrewd business sense. (Potentially expand on his family, advisors, etc.)\n\n- **Captain Azar (Tiefling, Androgynous):** The skilled and respected captain of the Dira' al-Waha. Azar is known for their calm demeanor under pressure, their keen sense of justice, and their unwavering loyalty to the citizens of Sandhaven. Their polished obsidian horns and subtly scaled skin are distinctive features.\n\n- **[[Inara al-Sahar]] (Caliph's Daughter):** The Caliph's eldest daughter, known for her sharp intellect and compassionate nature. She is often seen engaging with the citizens in the Bazaar, showing a genuine interest in their well-being, and is a strong advocate for the city's common folk. She possesses a subtle but firm political acumen.\n\n- **Sheikh Omar al-Din (Head Merchant):** The venerable and shrewd leader of the Sandhaven Merchant Council. Sheikh Omar oversees much of the city's trade operations, arbitrates disputes among vendors, and wields considerable influence through his vast network of connections. He is a master negotiator and a guardian of the Bazaar's prosperity.\n\n\n### Quest Hooks\n\n- **The Sealed Observatory:** Investigate the mysterious sealing of Bayt al-Nujum and the cryptic message \"The sky has broken.\" What celestial event or entity caused the scholars to withdraw? Can the party break the wards and discover the truth?\n\n- **Assassination Aftermath:** Uncover the perpetrators and motivations behind the assassination attempt on Caliph Sarif al-Khalid and his family, which occurred at the beginning of the Oasis Festival. Is it linked to the observatory's sealing?\n\n- **Oasis Bazaar Heist/Contest:** Engage in a high-stakes trade negotiation, stop a theft during the bustling Oasis Festival, or participate in a bazaar-wide competition.\n\n- **Desert Expeditions:** Explore the treacherous Sunblade Dunes, seeking ancient ruins, hidden oases, or encountering dangerous desert creatures.\n\n### Notable Celebrations:\n\n- **The Oasis Festival (Miriander days 1 - 40):** A month-long celebration when the desert blooms after the brief rainy season. The city holds grand market festivals with traders from across the Bounty.\n\n- **The Night of Tales (Pyrthendel 20):** A night of storytelling where the city's elders share tales of the desert's mysteries and the city's history.\n\n### Recent Events:\n\n- An assassination attempt on Caliph Sarif al-Khalid and his family occurred in early Calantheon\n\n- The Bayt al-Nujum observatory was mysteriously sealed, with its scholars leaving the message: \"The sky has broken.\"\n      "
      },
      {
        "id": "area-1753031405938",
        "name": "Stormharbor",
        "pronunciation": "TIDE-wah-ter",
        "x": 42.397241699918645,
        "y": 50.910405743949994,
        "width": 9.669546352613018,
        "height": 3.1405769777112056,
        "teaser": "**Stormharbor** is the largest city in *Azorian's Bounty*, and sits on the mysterious `Whispering Depths`.",
        "detail": "Stormharbor is the largest city in [[Azorian's Bounty]], and sits on [[Whispering Depths]].\n\n### Population\nApproximately 300,000 residents\n\n\tHumans: 50%  \n\tHalflings: 10%  \n\tHalf-Elves: 10%  \n\tTritons: 8%  \n\tTortles: 5%  \n\tWater Genasi: 5%  \n\tSea Elves: 3%  \n\tElves: 3%  \n\tDwarves: 3%  \n\tGnomes: 2%  \n\tTieflings: 1%  \n\tOther Races: 1%  \n\n### City Guard:\n[[Tidekeepers]]\n\n### Districts:\n* [[Nobles Respite]]\n* [[Craftsman's Enclave]]\n* [[Merchant's Bazaar]]\n* [[Scholar's Summit]]\n* [[Sea Trades]]\n* [[Creativity Corner]]\n* [[Verdant Tranquility]]\n* [[Mystique Mews]]\n* [[Global Quarter]]\n* [[Seafarer's Enclave]]\n\n### Points of Interest:\n* [[Lighthouse of Radiance]]\n\n### Notable NPCs:\n* [[Isabella Quickfoot]]\n* [[Wellkeeper Olara]]\n* [[Thrain Ironbeard]]\n* [[Lightholder Nadira Dawnshroud]]\n      "
      },
      {
        "id": "azorians-tower",
        "name": "Azorian's Tower",
        "pronunciation": "ah-ZOR-ee-an's TOW-er",
        "teaser": "A massive, twisted tower of **dark stone** that reaches several stories high, topped with mystical symbols and shimmering with a *protective magical aura*.",
        "detail": "A massive structure, reaching several stories in height. It's constructed of dark stone and has a slightly twisted, almost spiral design that gives it an eerie, otherworldly appearance. It's topped with a conical roof and adorned with mystical symbols etched into its surface. The tower's exterior seems to shimmer with a faint, protective magical aura."
      },
      {
        "id": "obsidian-spire",
        "name": "Obsidian Spire",
        "pronunciation": "ob-SID-ee-an SPIRE",
        "teaser": "A towering black spire rising from the heart of the city, shrouded in mystery and legend.",
        "detail": "Obsidian Spire is a massive, jet-black tower that dominates the skyline. Its origins are lost to history, and many believe it to be a remnant of ancient magic. The spire is both a symbol of power and a source of unease for the city's inhabitants."
      }
    ]
  }
]
