[
    {
        "date": "2023-10-17",
        "title": "A Memory Thief in Scholar's Summit",
        "recap": "The party investigated disappearances in Scholar’s Summit and fought Morvona the Memory Thief at Althea Flameheart’s home.\nWeledor and Gukki were incapacitated but later healed at Windward Hall.\nThey reported to Guildmaster Kaela Ravenshadow, who asked them to speak with Headmaster Thalindor Mumblethorn.\nUpon arriving at Lorehaven Academy, they learned the Headmaster had also vanished.\nIn his office, signs of a struggle and a hidden tunnel were found.\nFrantic scurrying was heard from within."
    },
    {
        "date": "2023-10-24",
        "title": "Descent into the Tunnels of Lorehaven",
        "recap": "The party fought darklings in Headmaster Mumblethorn’s office, then interrogated Constella, realizing she was innocent.\nFinn experienced a panic attack and heard an odd melody from Darwin.\nRetrieving their weapons, the party decided to descend into the hidden tunnel under Stormharbor without asking for help."
    },
    {
        "date": "2023-11-07",
        "title": "The Smuggler's Corpse and Demonic Creatures",
        "recap": "In the tunnels under the city, the party followed drag marks rather than eerie moaning.\nThey found a smuggler’s corpse, ghostly figures trapped in a conversation loop, and Finn received a disturbing vision before magical light was extinguished.\nThey fought two demonic creatures, one of which fled, leading them to a cavern with forest debris and a lit wooden house."
    },
    {
        "date": "2023-11-14",
        "title": "The Underground Troll and Whelps",
        "recap": "Inside the underground house, the party investigated necrotic magic from a stewpot and found two illusion-hidden doors.\nChoosing one path, they discovered a troll and whelps, waking them during a stealth attempt.\nThey killed the creatures but were left hurt and low on resources, uncertain whether to press on."
    },
    {
        "date": "2024-01-09",
        "title": "A Merrow in the Merchant's Bazaar",
        "recap": "During a storm in the Merchant’s Bazaar, the party had captured a merrow for Vurel Morridan."
    },
    {
        "date": "2024-01-18",
        "title": "An Unlikely Meeting",
        "recap": "The party saw Lirael Stormcrest with Maximillion Alastair III."
    },
    {
        "date": "2024-01-23",
        "title": "Developments in Sandhaven and Mumblethorn's Journals",
        "recap": "After repelling invading merrow, the party explored personal and plot developments.\nThey heard of an assassination in Sandhaven, an unlit lighthouse, and newly revealed ruins.\nOogway and Thodian learned about journals of memories from Headmaster Mumblethorn.\nWeledor’s performance boosted his ego, and several quests were seeded for future adventures."
    },
    {
        "date": "2024-02-20",
        "title": "The Reflective Room and a Planar Pull",
        "recap": "The party fought faceless creatures in a reflective room.\nWeledor was pulled into another plane."
    },
    {
        "date": "2024-03-26",
        "title": "The Ritual at Sanctuary Hills Asylum",
        "recap": "At the Sanctuary Hills Asylum, the party found Verner Darkholm conducting a ritual powered by the artifact Celemîr Teltaur.\nSlip arrived via a portal and joined the fight.\nIngvar Lightforge blessed the party, weakened Verner by severing his connection to the artifact, and urged them to attune to it.\nThodian fell in battle, and Ingvar transformed Neldrion into the Avatar of Anguished Souls before dying."
    },
    {
        "date": "2024-04-02",
        "title": "Defeat of Darkholm and the Cursed Artifact",
        "recap": "The party defeated Verner Darkholm and The Taskmaster, with Weledor attuning to Celemîr Teltaur.\nThey rescued Ingvar Lightforge and escaped the collapsing asylum, carrying Thodian’s body in hopes of resurrection."
    },
    {
        "date": "2024-05-07",
        "title": "The Motley Maverick's Carnival Crucible",
        "recap": "In Madam Yzmarr’s tent, repeated tarot results hinted at a weakening protection.\nInvestigating Ruxana Krakendrain’s missing ale, the party fought corrosive oozes and restored Ruxana’s true self by speaking her full name.\nTaken to The Motley Maverick’s carnival crucible, they fought sprites, pixies, quicklings, and dryads (some revealed as polymorphed workers).\nSlip attacked The Motley Maverick, prompting him to escalate the challenge."
    },
    {
        "date": "2024-06-18",
        "title": "Memories in the Mirror Maze",
        "recap": "The party learned of Clan Eyanfest’s involvement with The Mirror Knight.\nPsychic screams prevented details about origins.\nIn the mirror maze, Thodian touched a memory of his brother’s abduction and Malachite’s attack on Azorian.\nOogway nearly died probing another memory.\nThey fought phase spiders, with Oogway poisoned again, before meeting Grimscale."
    },
    {
        "date": "2024-06-25",
        "title": "Twilight's Cradle and The Mirror Knight",
        "recap": "Grimscale, a redcap bound to aid Thodian, revealed the realm was Twilight’s Cradle.\nOpening cocoons, he freed faun Elowen Duskdancer, who gave the party a locket tied to The Mirror Knight’s true name.\nThey touched a ceremonial sword and entered a memory revealing The Mirror Knight’s past, her connection to Luthain, and a scene involving The Shattered King, Arcane Confidant, and Fractured Prince."
    },
    {
        "date": "2024-07-23",
        "title": "Dorian's Revelation and The Echoing Bard",
        "recap": "In The Mirror Knight’s lair, Thodian dueled her while Slip fought Grimscale.\nBreaking mirrors aided Thodian.\nConvincing her to yield, they learned Dorian lived, that The Shattered King should be saved, and that answers lay with The Echoing Bard.\nWeledor’s song angered her, prompting this clue.\nThey left to find a much older Dorian waiting."
    },
    {
        "date": "2024-10-22",
        "title": "Gnoll Attack in Redhill",
        "recap": "After hearing the dire warning from The Oracle, the party heard an explosion and howling from the north of Redhill.\nThey battled a group of gnolls that initially focused on killing civilians, with each death seemingly giving them more power.\nAfter a few civilians were killed, a deep voice commanded the gnolls, who began attempting to kidnap the survivors.\nSlip fell to the gnolls' attacks but was saved by Shinusu Rampart before he died."
    },
    {
        "date": "2024-11-05",
        "title": "Infiltrating the Redhill Mines",
        "recap": "The party defeated the gnolls in the town square of Redhill, stopping one kidnapping but not the other.\nDuring the combat, each party member saw a fiendish entity out of the corner of their eyes, which grew closer with each turn before disappearing.\nThey heard more screams and howls and headed north to stop the gnolls once and for all.\nFinding evidence of more attacks and kidnappings, they scouted the entrance to the mines, where gnolls were focused on clearing debris.\nThe party decided to try a sneak attack to draw the creatures out.\nSlip successfully sneaked in and attacked a gnoll, which let out a loud howl of pain."
    },
    {
        "date": "2024-11-26",
        "title": "Visions from the Herald of Despair",
        "recap": "The party buried Gukki in a cairn outside the mine entrance.\nVillager Nolan slipped into the mine, and Slip, following him, was suddenly transported to a balcony in Stormharbor where he saw a demonic figure, The Herald of Despair, who offered him what his heart desired if he helped free its master, Tormenauk.\nSlip was returned to the mines, and as the party followed Nolan’s trail, each member had a similar vision and offer from The Herald of Despair.\nThey eventually found their way into deeply buried ruins and descended into them."
    },
    {
        "date": "2024-12-03",
        "title": "A Demonic Dog and Mechanical Constructs",
        "recap": "After descending into the ruins, the party found Zorron encased in a resin bubble. Shinusu Rampart broke the bubble, freeing Zorron, who was suffering from memory loss but remembered who Tormenauk was.\nWeledor triggered the same trap while questioning Zorron, but Slip quickly freed him.\nKiera and Harris bolted from the room.\nWeledor, Thodian, and Slip chased Harris into a large room with a giant, non-hostile demonic dog named Valkorth, who charmed both Weledor and Harris.\nMeanwhile, Oogway returned to the hallway where he was attacked, and Shin, Enigma, and Zorron heard mechanical movement from the room above them."
    },
    {
        "date": "2024-12-10",
        "title": "The Specter and the Mechanical Constructs",
        "recap": "After Harris bolted from the chamber with Valkorth, Oogway followed closely, with Slip and Weledor catching up.\nThey encountered Nolan, who was acting strangely under the influence of a specter.\nMeanwhile, Shin, Zorron, and Enigma fought and defeated several mechanical constructs.\nDuring the chaos, the other villager (a merchant) seized the opportunity to venture deeper into the ruins."
    },
    {
        "date": "2024-12-17",
        "title": "Kez’raeth and Two Suns",
        "recap": "Weledor was snapped out of his trance when Oogway was struck by one of Nolan's arrows.\nTheir efforts to reason with Nolan were interrupted when Kez’raeth, the Iron-Hearted, stormed in and cleaved Nolan in half with a single strike.\nRealizing they were outmatched, Weledor, Zorron, and Shin retreated, blocking the entrance to the ruins with a large boulder.\nExiting the mine, they were greeted by an unsettling sight: the sky had two suns."
    },
    {
        "date": "2025-01-07",
        "title": "Umbryss and the Unraveling World",
        "recap": "Zorron and Enigma were overwhelmed by memories.\nZorron identified the second sun as Umbryss, a harbinger of doom, and recalled his hunt for the Shards of Maltheris.\nAs Umbryss faded, his memories fell back into a haze.\nThe earth rumbled, and spiraling runes erupted from the ground, spreading out from the ruins.\nIn a terrifying transformation, a herd of deer shifted into fiendish creatures, writhing and screaming in agony."
    },
    {
        "date": "2025-01-14",
        "title": "A Race Against Time to Azorian's Tower",
        "recap": "Realizing the villagers were likely freeing Tormenauk, the party rushed back to Redhill.\nThey noticed the flora dying where the runes spread.\nThe people of Redhill appeared dazed, some engaging in emotionless fights.\nThey gathered Zarina and their coach driver, Balin Stonefoot, from the Crimson Hearth Inn and decided to leave for Azorian's Tower to seek his aid.\nThey learned that Josh had left town with Valdus of the Shadow Blades, and the Oracle later revealed he had not left willingly."
    },
    {
        "date": "2025-01-21",
        "title": "The Oracle's Cryptic Warnings",
        "recap": "The Oracle followed them, interacting with each party member.\nShe found it odd she couldn’t see Zorron, noted Thodian seemed split in two, and told Slip he wasn’t ready for what she had to say.\nTo Weledor, she apologized for his burdens and praised his music.\nShe had a longer conversation with Oogway, revealing his and Princess Aeliana's lives were linked.\nHe accepted her help, which accelerated his poisoning but allowed him to see through the eyes of a Shadow Blade, confirming their infiltration of the Coral Guard.\nOn their seven-day journey to Azorian's Tower, they discovered Thodian had been infected with the same poison, and he briefly inhabited Dorian's body in Twilight's Cradle."
    },
    {
        "date": "2025-01-28",
        "title": "The Fall of Azorian's Tower",
        "recap": "The party arrived at Azorian's Tower, finding the Coral Guard camped outside, unable to enter.\nOogway joined the Guard, hoping to expose the Shadow Blades and protect the royal family.\nAs the others searched for a way in, Weledor's **Celemîr Teltaur** pulled him toward a door that opened to an old man.\nThey entered, and the old man instructed Weledor to place the **Celemîr Teltaur** on a pedestal.\nHe then accused them of spying due to their Silver Masks tattoos, and he and the artifact were blasted into atoms, causing the tower to crumble.\nFalling into a hidden chamber, they saw six statues and a seated man.\nZorron could hear whispers from the statues. Thodian touched a statue of Orthon, was briefly ensnared, and broke free, revealing a tombstone.\nSlip touched a statue of a woman, causing it to vanish and revealing a leather cloak.\nWeledor repeated a despairing song from a bard's statue, which then changed its expression.\nZorron healed a dwarf statue, which crumbled to reveal a tombstone.\nWith all four statues dealt with, the seated man stood, revealed as a younger version of the old man, then collapsed to his knees, weeping as a door opened fully.\nThe party moved through the door."
    },
    {
        "date": "2025-02-04",
        "title": "Eyanfest's Might and the Prophecies of Darwin",
        "recap": "In Azorian's study, the party grew frustrated with his lack of response.\nThodian wrote down Finn's translated messages from Darwin: 1. Galadon's army has gathered at the gates, 2. The walls of X'yrath have fallen, 3. The ember seat sits empty, 4. The veil is failing, 5. The cult of the voidwalker has discovered the key.\nAzorian read the parchment, his eyes becoming more focused as an animated suit of armor, Eyanfest's Might, challenged Thodian to a duel.\nSlip found self-writing journals for major cities, each with updates.\nHe saw reports of: a 'sky has broken' message and missing caravans in Sandhaven; unregistered ships, missing people, and a creature in Harborwatch; creeping corruption and memory loss in Silvershade; strange monk behavior and a glowing ship in Tidewater; and Henrietta Haulblood's disappearance, Elaria Starfall's unconsciousness, and the rumored return of the Crimson Cartel in Stormharbor."
    },
    {
        "date": "2025-06-03",
        "title": "A Palace Crumbles, A Glimpse of the Future",
        "recap": "## A Palace Crumbles, A Tunnel Beckons\n\nThe last session threw the party right into the chaos following Grom Blackthorn’s defeat. With the palace in Tidewater collapsing around them, survival was the immediate priority. They snatched up Grom’s staff, a mysterious pendant, a book, and a pouch of magical seeds, wisely choosing to deal with them later. Their escape route was a desperate dive into the throne room’s central pool—a passage Oogway knew led to the sea.\n\n## Azorian's Resting Place and a Glimpse of the Future\n\nThe journey through the flooded tunnel was a shock; it was clearly meant for creatures at home in the deep. Mid-journey, the party stumbled upon a hidden, dry cavern—a surprisingly intact resting place that suggested it belonged to none other than **Azorian**. Taking a much-needed breather, the weight of their situation became clear: a long swim ahead and only one party member truly equipped for it. Yet, the **cursed Celemîr Teltaur** around Weledor’s neck began to hum, subtly pulling them deeper into the cavern, guiding their next steps. This led them to a truly immense, flattened-egg-shaped cavern. In its heart, a **gigantic Celemîr Teltaur** spun, suspended between colossal stalactites and stalagmites.\n\n## A Dangerous Ascent and a Shocking Revelation\n\nA strategic debate ensued. **Weledor** feared his own corrupted anchor might taint the massive one, while **Oogway** worried about his worsening infection from the Widow Pearls. Boldly, **Slip**, **Shin**, and **Zorron** volunteered to attune to the great anchor, deciding to ascend and leaving **Oogway**, **Weledor**, and **Thodian** below. As the three ascended, they encountered unsettling passageways that opened to what appeared to be visions of other places. One showed the bloody streets of Harborwatch, littered with dwarven bodies and patrolled by ominous black-armored soldiers. Another depicted Tidewater as it utterly collapsed into ruin under Blackthorn's corrupting influence. Reaching the summit, Slip and Shin jumped across the final platforms to the gigantic Celemîr Teltaur. Shin warned Slip of the raw, immense power emanating from it, describing it as 'being in the sea during a raging storm.' Undeterred, Slip touched the anchor. In an instant, Slip was ripped from the cavern and transported to a pristine college in a place called **Cyr'dymvyr**, a place he'd never heard of. There he learned shocking truths: the year was **1747**, over 1300 years in the future, and Azorian had vanished over 400 years ago. Before he could ask more, Slip was pulled back to the cavern as the enormous Celemîr Teltaur dramatically shrunk to the size of a medallion.\n\n## A New Path Emerges\n\nBelow, Oogway, Thodian, and Weledor witnessed the anchor's transformation and made their way down, passing two more disturbing visions. One showed an empty street in what they recognized as Stormharbor. The other revealed a bright, sunny city, eerily peaceful but for a few bodies covered in sand. The session concluded with the party reunited on the cavern's lower level, the miniaturized Celemîr Teltaur now in Slip’s possession. Thodian was captivated by the portal showing the 'sunny city,' wanting to investigate it further as the others reached the bottom. What mysteries does this new medallion hold, and will the party follow Thodian into the sun-drenched city? The path forward remains uncertain."
    },
    {
        "date": "2025-07-01",
        "title": "A Waystation Between Worlds",
        "recap": "The party finished solving the problems in The Waystation Between Worlds and did their 'shopping'.\n\n**Thodian** was tempted to enter a one-way door to Twilight's Cradle, received a hint about Eyanfest's Might, and was marked for death by the devil **Xylos, the Corrupter**.\nThe party figured out that The Caretaker is Mindy's brother and that he is from Twilight's Cradle.\nThey learned from Xylos, who is magically forced to tell one truth a day, that **Azorian** had summoned him, tricked him into helping create a powerful magic item, and then imprisoned him.\n**Oogway** learned that the cure for his Void Poison is in Obsidian Spire, but that he may need to sacrifice himself to save Princess Aeliana Seastone.\nThodian was given a one-time teleportation rod to return to the Waystation.\nThe party was warned about waking **Khatep**.\n**Weledor** received **Songweaver**.\n**Zorron** received **Mirror's Edge**."
    },
    {
        "date": "2025-07-06",
        "title": "The Fall of Sandhaven",
        "recap": "The party arrived in Sandhaven, where they were kicked out of Ashyra's temple by **Khatep**.\nThey found **Inara al-Sahar** and a group of citizens hiding in a cavern from an incursion.\nDuring introductions, all but Thodian were compelled to go to the city square, where they witnessed **Despair** murder **Sarif al-Sahar**, the caliph of Sandhaven and Inara's father, and unleash monsters on the citizens.\nThe party, along with Inara, Captain Azar, and about 30 civilians including a group of street children called **The Dust Rats**, fled back to the safety of the caverns.\n**Oogway** promised to help Inara get revenge against Despair.\nKhatep told the party they cannot enter the teleportation chamber until they retrieve Ashyra.\nInara revealed that she has Sandhaven's **Celemîr Teltaur** and will give it to the party if they help her free the city.\n**Slip** befriended **Aurel Sunshield**, the 'leader' of The Dust Rats, and swore to help them.\nOogway was haunted by Despair’s words about his past failures and his fear of failing Princess Aeliana, but was also inspired by the beauty of Sandhaven.\nThodian was angered by Despair's words about his inability to save Dorian."
    },
    {
        "date": "2025-07-13",
        "title": "Hope and Flight in the Caverns",
        "recap": "After retreating to the caverns, the party met **Magnolia**, a healer tending to the wounded. **Oogway** spoke with **Inara al-Sahar**, who acknowledged her new role as queen but deferred the conversation until the city was reclaimed. The party helped with the wounded, with Magnolia taking the lead. **Weledor** played music to calm the people and gave his old pan flute to a young Dust Rat named **Nali**, who ran off to practice.\n\n**Thodian** spoke with **Halim Whisperhand**, who revealed that the teleportation chamber was actually the lost library of **Ashyra**. Halim suggested they use it to escape, but the party explained that **Khatep** had locked it, making escape impossible.\n\nJust as the party was making a plan to face **Despair**, flying aberrations attacked the caverns, forcing everyone to flee their supposed sanctuary."
    },
    {
        "date": "2025-07-20",
        "title": "A Desperate Flight Through Sandhaven",
        "recap": "Emerging from the caverns beneath Sandhaven, the party collapsed the tunnel behind them, cutting off pursuit from the horrors below. They were immediately met with new dangers: shrieking winged horrors in the sky and the howls of approaching monsters.\n\nSurfacing in the city’s outer districts, they found a small group of survivors, including the street kid **Aurel** and **Captain Azar**.\nCaptain Azar proposed a plan: fortify the city watch headquarters, **Dira’ al-Waha**, as a last bastion of defense. The party realized that to abandon these survivors was to condemn them.\n\nMoving through the ruined streets, they were attacked by a trio of hellhounds. They defeated the beasts, but the noise attracted more dangers, and four more civilians were lost to flying horrors.\n\nThe remaining survivors are exhausted and broken. They now face roughly three more hours of dangerous travel to reach the headquarters—their last hope for safety."
    }
]